{"id":573,"date":"2020-08-13T19:07:26","date_gmt":"2020-08-13T19:07:26","guid":{"rendered":"https:\/\/mycryptoadvisor.com\/?p=573"},"modified":"2020-08-13T19:07:26","modified_gmt":"2020-08-13T19:07:26","slug":"demystifying-cryptocurrency","status":"publish","type":"post","link":"https:\/\/mycryptoadvisor.com\/2020\/08\/13\/demystifying-cryptocurrency\/","title":{"rendered":"Demystifying Cryptocurrency"},"content":{"rendered":"\n<p>Could you imagine never owning a bank account?&nbsp; In 2017 the World Bank reported that around 1.7 billion adults are unbanked globally.<\/p>\n\n\n\n<p>Blockchain is often regarded as the “Internet of Money”. To access financial services, all you need is a mobile phone and internet connection! Anyone can download a Digital Wallet, earn passive income, and use their cryptocurrency as collateral for a loan. All without a credit score or minimum deposit. The interest rates are better than any traditional bank. One popular Decentralized Finance (DeFi) application called Compound is offering interest rates ranging from .88 – 13% as of this writing. In our modern world of interconnectivity, every citizen should be entitled to equal access to financial services. Blockchain technology is leveling the playing field – now the farmer in a developing country will have the same access to financial opportunities as the stockbroker on Wall Street.<\/p>\n\n\n\n<h4>Is The U.S. Dollar A Safe Haven?<\/h4>\n\n\n\n<p>In March 2020 household debt levels hit a record high of <a href=\"https:\/\/www.cnbc.com\/2020\/05\/05\/consumer-debt-hits-new-record-of-14point3-trillion.html\" target=\"_blank\" rel=\"noreferrer noopener\">$14.3 trillion<\/a>, which surpassed the record achieved during the 2008 financial crisis. Last month Stephen Roach, Yale University Sr. Fellow predicted a <a href=\"https:\/\/www.cnbc.com\/2020\/06\/15\/dollar-crash-is-almost-inevitable-asia-expert-stephen-roach-warns.html\" target=\"_blank\" rel=\"noreferrer noopener\">35% <\/a>drop in the U.S. Dollar within the “next year or two, maybe more”. Even <a href=\"https:\/\/www.cnbc.com\/2020\/06\/22\/usds-demand-as-emergency-dollar-could-be-waning-deutsche-bank-says.html\" target=\"_blank\" rel=\"noreferrer noopener\">Deutsche Bank <\/a>is sounding the alarm, recently reporting that “the emergency dollar demand seems to be waning”. Due to the U.S. Dollar’s privilege of being the world’s reserve currency, investors typically flee to the currency during times of uncertainty. With America decoupling from the world, record deficit spending, and low savings rate &#8211; investors may want to rethink their safe haven assumption.<\/p>\n\n\n\n<p>Since 1913 the U.S. Dollar has lost 96% of its value and 17% of that loss in purchasing power transpired after the 2008 financial crisis as per <a href=\"https:\/\/www.bls.gov\/data\/inflation_calculator.htm\" target=\"_blank\" rel=\"noreferrer noopener\">the U.S. Bureau of Labor Statistics. $1 worth of<\/a> groceries back in 1913, would cost you $26.16 today.  How much more value will the U.S. Dollar lose? One of the revolutionary features of Bitcoin is the fixed supply.<\/p>\n\n\n\n<p>Only 21 million Bitcoins will be issued, unlike traditional currencies which can be printed infinitely and &#8220;out of thin air&#8221;. It&#8217;s this unlimited supply which will continue to erode the value of our U.S. Dollar over time. Adopting a cryptocurrency with a fixed supply could be the solution to fixing the world economy.<\/p>\n\n\n\n<h4>Crypto News Roundup<\/h4>\n\n\n\n<p>The march towards mainstream cryptocurrency adoption continues. Over <a href=\"https:\/\/coinatmradar.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">8,500 Bitcoin ATMs <\/a>have been installed in 73 different countries and 74% of the ATMs are found in the United States.  Since the introduction of Bitcoin ATMs in 2013, the speed of installation is accelerating. 6,352 ATMs were in operation as of January 2020 which is a 39% increase in the matter of six months. Bitcoin ATMs allow a user to scan a QR code on their mobile phones to sell their cryptocurrency for a country’s local currency. The same concept can be applied to purchasing items from vending machines. In Australia and New Zealand, users can now purchase <a href=\"https:\/\/news.bitcoin.com\/coca-cola-machines-accept-bitcoin\/\" target=\"_blank\" rel=\"noreferrer noopener\">Coca-Cola <\/a>products from over 2,000 vending machines.<\/p>\n\n\n\n<p>Blockchain technology is tearing down borders and creating a more seamless financial system. Even Institutional Investors are starting to foresee the revolution and are growing comfortable with the idea of allocating digital assets to their portfolios. A survey conducted by <a href=\"https:\/\/www.fidelitydigitalassets.com\/bin-public\/060_www_fidelity_com\/documents\/FDAS\/institutional-investor-study.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Fidelity <\/a>found that 36% of Institutional Investors in the United States and Europe are currently invested in digital assets. 60% of the Institutional Investors surveyed “believe digital assets have a place in their investment portfolio”. The most popular digital assets Institutional Investors had exposure to were Bitcoin and Ethereum. In the next decade, cryptocurrencies may hold a place in every investor’s portfolio if these trends continue.<\/p>\n\n\n\n<p>Are you interested in learning more about blockchain and cryptocurrencies? Register for our upcoming webinars <a href=\"https:\/\/www.eventbrite.com\/o\/alex-enser-29990929164\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>!<\/p>\n\n\n\n<p>Contact <a href=\"https:\/\/mycryptoadvisor.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">support@mycryptoadvisor.com <\/a>to schedule a one-on-one or group consultation. Stay safe and healthy everyone!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Could you imagine never owning a bank account?&nbsp; In 2017 the World Bank reported that around 1.7 billion adults are unbanked globally. Blockchain is often regarded as the “Internet of Money”. To access financial services, all you need is a mobile phone and internet connection! Anyone can download a Digital Wallet, earn passive income, and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":577,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"_links":{"self":[{"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/posts\/573"}],"collection":[{"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/comments?post=573"}],"version-history":[{"count":0,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/posts\/573\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/media\/577"}],"wp:attachment":[{"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/media?parent=573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/categories?post=573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mycryptoadvisor.com\/wp-json\/wp\/v2\/tags?post=573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}